---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctShape
source: html/3b512e73-a626-b0a0-42b7-a8bd0f6e2ca9.htm
---
# Autodesk.Revit.DB.Mechanical.DuctShape

Enumerated type listing possible shapes for ducts.

## Syntax (C#)
```csharp
public enum DuctShape
```